<script>
  import router from '../router.js';

  function start() {
    router.push('/train-pick');
  }
</script>

<h1>PITCH TUTOR</h1>
<p class="short">Репетируй и прокачивай свои презентационные навыки</p>
<p>
  Pitch Tutor - это симуляция онлайн - презентации питча. Вы можете презентовать проект одному или  группе инвесторов, с
  демонстрацией презентации или без нее. При этом, во всех режимах одно из окон транслирует вас. Когда вы видите перед
  собой лица реальных людей, активируются зеркальные нейроны. Вы испытываете реальные эмоции.
</p>
<p>
  <strong>
    Цель Pitch Tutor - дать вам контроль над своими эмоциями, совладать с волнением и сосредоточиться на своем питче.
  </strong>
</p>
<p>
  Провести аналитику вашего поведения во время питча поможет трекер лица. Пока он находится в стадии разработки и
  способен распознавать простейшие эмоции. Со временем самообучаемая система сможет выдавать полноценный аналитический
  отчет. В будущем в совокупности с видео записью вашей речи, вы сможете быстрее выявить недочеты и еще эффективнее
  отточить навыки презентации.
</p>
<p class="go"><button class="btn" on:click={start}>Начать тренировку</button></p>

<style>
  h1 {
    font-size: 64px;
    font-weight: 900;
    text-align: center;
    color: #4487ec;
    margin: 0;
    padding: 20px;
  }

  .short {
    margin: 40px 0;
    font-size: 24px;
  }

  p {
    font-size: 20px;
    text-align: center;
  }

  .go {
    text-align: center;
  }

  button {
    background: #4487ec;
    box-shadow: 0px 0px 12px 1px rgba(0, 0, 0, 0.2);
    border-radius: 40px;
    color: #fff;
    border: 0;
    font-size: 24px;
    padding: 18px 32px;
    margin: 30px 0;
  }
</style>
